[
  {
    "name": "Chelonia",
    "id": 180,
    "image": "Turtle",
    "description": "The forest gives way to a number of strangely-shaped dwellings. Each is nearly identical in shape, sporting four windows and a front and back door. ",
    "areaURL": "Chelonia",
    "unlockableAreas": [
      {
        "areaURL": "SubfentonStows",
        "buttonText": "Head up the trail"
      },
      {
        "areaURL": "AncientDocks",
        "buttonText": "Head north"
      }

    ]
  },
  {
    "name": "Subfenton Stows",
    "id": 181,
    "image": "Gate",
    "description": "The trail leads up to a small community. The houses here look nothing like the strange constructions at the bottom of the hill. A particularly ornate building lies along the entrance, and a rusty sign rests on the gate that towers above the entrance. It reads, \"Subfenton Stows:The last place you'll live!\"",
    "areaURL": "SubfentonStows"

  },
  {
    "name": "Ancient Docks",
    "id": 182,
    "image": "Docks",
    "description": "The path leads down through the thick forest to a small set of docks made from stone. The water appears to lead out to the sea on one end. It looks like at least one sailor is still using these ancient docks. A number of green plants with yellow flowers grow along where the docks meet the woods. The path continues along to the north, where the roof of a castle can be seen glowing in the distance.",
    "areaURL": "AncientDocks",
    "unlockableAreas": [
      {
        "areaURL": "GiltgrainCastle",
        "buttonText": "Continue north"
      }

    ],
    "actions": [
      "Pick Plants:Madder Root:You begin picking the plants."
    ]
  },
  {
    "name": "Giltgrain Castle",
    "id": 183,
    "image": "Castle",
    "description": "The castle's roof glitters with thousands of ornate jewels. It appears entirely out of place in the dilapidated streets that surround it. A lone guard stands at the gate to the castle's front entrance. A ladder rests along the side of one wall, reaching just high enough to climb over.",
    "areaURL": "GiltgrainCastle"
  }
]