[
  {
    "name": "Chelonia",
    "id": 180,
    "image": "Dome",
    "description": "The forest gives way to a number of strangely-shaped dwellings. Each dome is nearly identical in shape, sporting four windows and a front and back door. One large dome sits at the edge of the village and another dome boasts a sign reading, \"Mines\" above each of the doors and windows.",
    "areaURL": "Chelonia",
    "unlockableAreas": [
      {
        "areaURL": "SubfentonStows",
        "buttonText": "Head up the trail"
      },
      {
        "areaURL": "AncientDocks",
        "buttonText": "Head east"
      }

    ],
    "buildings": [
      {
        "name": "Chelonium Goods",
        "buttonText": "Enter the largest dome",
        "url": "CheloniumGoods",
        "description": "The dome is well lit and spacious. A woman sits in the center of the room, which is surrounded on all sides by countless bags of gemstones and what appear to be helmets.",
        "npcs": [
          "Nodlesh"
        ],
        "shops": [
          {
            "name": "Chelonia Goods",
            "currencyName": "Chelonic Fragments",
            "itemNames": [
              "Bag of Assorted Gems",
              "Helm of Chelonia"

            ]

          }
        ]
      },
      {
        "name": "Chelonia Mines",
        "buttonText": "Enter the mine",
        "url": "CheloniaMines",
        "description": "A ladder leads down into a dark underground tunnel system. Torches light the walls as far as the eye can see.",
        "actions": [
          "Mine Walls:Chelonite,Chelonic Fragments,Chelonic Powder,Chelonic Fragments,Chelonic Powder,Chelonic Powder:You swing your pickaxe into the tunnel wall."
        ]
      }
    ]
  },
  {
    "name": "Subfenton Stows",
    "id": 181,
    "image": "Gate",
    "description": "The trail leads up to a small community. The houses here look nothing like the strange constructions at the bottom of the hill. A particularly ornate building lies along the entrance, and a rusty sign rests on the gate that towers above the entrance. It reads, \"Subfenton Stows:The last place you'll live!\" All the houses of the community surround a small open area with a few trees. Roots have overgrown the fountain centerpiece which is no longer running. The tallest tree of the plaza shoots out of the main fountainhead. A strange machine sits in one corner of the plaza.",
    "areaURL": "SubfentonStows",
    "buildings": [
      {
        "name": "The Faddium",
        "buttonText": "Enter the faddium",
        "url": "TheFaddium",
        "description": "There are no windows into the building, but it is lit by dozens of bright candles along the walls. The main chamber leads to an ornate throne, upon which a hooded figure sits.",
        "npcs": [
          "Inomi"
        ]
      }
    ],
    "conversionActions": [
      "Operate Machine:Great Arrow Shaft Pack:Great Tree Logs:You spin the crank and the machine begins to whir."
    ]

  },
  {
    "name": "Ancient Docks",
    "id": 182,
    "image": "Docks",
    "description": "The path leads down through the thick forest to a small set of docks made from stone. The water appears to lead out to the sea on one end. It looks like at least one sailor is still using these ancient docks. A number of green plants with yellow flowers grow along where the docks meet the woods. The path continues along to the north, where the roof of a castle can be seen glowing in the distance. Strange, rectangular stones line the bottom of the shallow, clear water.",
    "areaURL": "AncientDocks",
    "npcs": [
      "Calm Waters"
    ],
    "unlockableAreas": [
      {
        "areaURL": "GraingiltCastle",
        "buttonText": "Continue along the shore"
      }

    ],
    "actions": [
      "Pick Plants:Madder Root:You begin picking the plants.",
      "Go Fishing:Swordfish,Carp,Scallop:You start fishing..."
    ]
  },
  {
    "name": "Graingilt Castle",
    "id": 183,
    "image": "Castle",
    "description": "The castle's roof glitters with thousands of ornate jewels. It appears entirely out of place in the dilapidated streets that surround it. A lone guard stands at the gate to the castle's front entrance. A ladder rests along the side of one wall, reaching just high enough to climb over.",
    "areaURL": "GraingiltCastle",
    "npcs": [
      "Giltgrain Guard"
    ],
    "unlockableAreas": [
      {
        "areaURL": "GraingiltCourtyard",
        "buttonText": "Climb the ladder"
      }

    ]
  },
  {
    "name": "Graingilt Courtyard",
    "id": 184,
    "image": "Wall",
    "description": "A guard is immediately alerted to your presence. You can chose to fight them out here, or find a place to hide somewhere inside.",
    "areaURL": "GraingiltCourtyard",
    "monsters": [
      "Graingilt Guard",
      "Graingilt Archer"
    ],
    "buildings": [
      {
        "name": "Graingilt Halls",
        "buttonText": "Hide inside",
        "url": "GraingiltHalls",
        "description": "The dark long corridors of the building are stuffed with sealed treasures. With the right key, you could probably open some of them.",
        "itemExchange": "Unlock Treasures:Graingilt Castle:Graingilt Treasure Key:You put a key to a lock..."
      }
    ]
  }
]