[
  {
    "name": "Mayor's Assistant",
    "id": 0,
    "completionText": "Congratulations! You completed Mayor's Assistant! The mayor has rewarded you with a copper axe and you learned a thing or two about cutting wood along the way.",
    "progressToComplete": 6,
    "requirements": [
      {
        "skill": "Woodcutting",
        "skillLevel": 3
      }
    ],
    "rewards": [
      {
        "skill": "Woodcutting",
        "experienceGain": 500
      },
      {
        "item": "Copper Axe",
        "itemAmount": 1
      }
    ],
    "progressStrings": [
      "You haven't started this quest yet. Talk to the mayor in Teppas to begin.",
      "The mayor has asked you for a favor.",
      "The mayor has asked you to make a no soliciting sign for him. ",
      "You've agreed to help the mayor make a sign.",
      "The sign man has told you what you need to make a sign: 3 white pine logs and some shuniku berries.",
      "The sign man has given you the sign you asked for. It's not very good.",
      "You gave the sign man's awful sign to the mayor. You completed the quest! The mayor doesn't seem too pleased, though.",
      "You made the sign yourself and gave it to the mayor! He was quite pleased. You've completed the quest!"
    ]
  },
  {
    "name": "Oriole Ornithology",
    "id": 1,
    "completionText": "Congratulations! You completed the tutorial! You now know everything you need to know to set out on an adventure! Good luck out there!",
    "progressToComplete": 6,
    "rewards": [
      {
        "skill": "Woodcutting",
        "experienceGain": 50
      }
    ],
    "progressStrings": [
      "You haven't started this quest yet. Talk Tuto in Quepland Fields to begin.",
      "You met Tuto the Oriole.",
      "Tuto told you to visit your bank and withdraw your axe.",
      "Tuto told you the bank is at the top left corner of the screen.",
      "Tuto told you to click the axe in your bank.",
      "Tuto told you to return to Quepland Fields and click Chop White Pine. You'll gain woodcutting experience.",
      "You've completed the tutorial!"
    ]
  },
  {
    "name": "Mound Is Missing",
    "id": 2,
    "completionText": "Congratulations! You solved the mystery!",
    "progressToComplete": 29,
    "rewards": [
      {
        "skill": "Fishing",
        "experienceGain": 1000
      }
    ],
    "progressStrings": [
      "You haven't started this quest yet. Go to Mound's Boats at the Uragota docks to begin.",
      "You spoke to Gordo and he is very suspicious. Maybe someone in town knows what happened.",
      "Ittru the fisherman said Mound disappeared last year. Kazkagrin is a fortune teller in town who may know more.",
      "A traveller suggested you visit Kazkagrin's Fortunes to find out what happened to Mound.",
      "The traveller was unecessarily rude to you. Regardless, you should visit Kazkagrin's Fortunes.",
      "You've asked for help in locating Mound.",
      "Kazkagrin has begun telling you all about Mound.",
      "Kazkagrin has begun telling you Mound's life story.",
      "Kazkagrin is still telling you about Mound.",
      "Kazkagrin is telling you all about Mound.",
      "Kazkagrin is telling you all about Mound.",
      "Kazkagrin is telling you all about Mound.",
      "Kazkagrin is telling you all about Mound.",
      "Kazkagrin is telling you all about Mound.",
      "Kazkagrin is telling you all about Mound.",
      "Kazkagrin has asked you to find something of Mound's to help locate him. You'll have to get into his house somehow.",
      "You broke into Mound's house.",
      "You took a hat from Mound's house. You can show it to Kazkagrin.",
      "Kazkagrin said you should look for Mound in a canyon to the east. It sounds like Higashi Woods...",
      "You found Mound! He was at the bottom of Higashi Canyon.",
      "Mound has offered you something to leave him be.",
      "You've demanded more from Mound.",
      "You asked Mound to tell you a story.",
      "Mound has started telling you a story.",
      "Mound is telling you a story.",
      "Mound is telling you a story.",
      "Mound is telling you a story.",
      "Mound is telling you a story.",
      "Mound is telling you a story.",
      "Mound has given you a map to a special island! If you lose it, you may be able to get him to draw you a new one. Quest complete!"
    ]
  },
  {
    "name": "Case of the Dead Pirate",
    "id": 3,
    "completionText": "Congratulations! You discovered the murderer! Probably. You can talk to the crew on the island to see if you were right. You spent the remaining time at sea learning from the pirate crew.",
    "progressToComplete": 100,
    "rewards": [
      {
        "skill": "Swordsmanship",
        "experienceGain": 10000
      },
      {
        "skill": "Archery",
        "experienceGain": 5000
      },
      {
        "skill": "Culinary Arts",
        "experienceGain": 3000
      },
      {
        "skill": "Woodworking",
        "experienceGain": 5000
      }
    ],
    "progressStrings": [
      "You haven't started this quest yet. You'll need to complete Mound is Missing before starting this quest on the pirate ship in Uragota Town.",
      "You've been invited to ride on the pirate ship, for a price.",
      "You've boarded the pirate ship."
    ]
  },
  {
    "name": "Chrysopoeian Crisis",
    "id": 4,
    "completionText": "Congratulations! You solved the crisis!",
    "progressToComplete": 1000,
    "rewards": [
      {
        "skill": "Alchemy",
        "experienceGain": 3000
      },
      {
        "skill": "Knifesmanship",
        "experienceGain": 2000
      }
    ],
    "progressStrings": [
      "You haven't started this quest yet. You can begin by talking to the man at the peak of Mt. Queple.",
      "Oikaaz advised you to visit the Alchemist's Guild in Tsu City to learn alchemy from a teacher."
    ]
  },
  {
    "name": "Grand Theft Camel",
    "id": 5,
    "completionText": "Congratulations! You can now purchase camels from Camelpalooza!",
    "progressToComplete": 24,
    "progressStrings": [
      "You haven't started this quest yet. Talk Camel Carl at the Desert's Mouth to begin.",
      "Carl has revealed to you that his camels were stolen.",
      "You offered to help Carl with his camels.",
      "You have convinced Carl you are willing to help him.",
      "Carl has explained that some pirates have stolen his camels.",
      "He thinks they may have already sailed away from a port town.",
      "You have told Carl to try and figure out his own problems.",
      "Carl has gone off to see if he can find the pirates on his own. He probably went to Uragota Town.",
      "Carl has found the pirates, but he's too afraid to fight them himself.",
      "You've encouraged Carl to fight his own battles, but he doesn't have a weapon! He needs an iron sword.",
      "You've gotten Carl his sword, but now he wants armor. A wild boar shirt, specifically.",
      "You got Carl an iron sword and armor, but now he's demanding food. You need to bring him 5 Abalone Rolls. Maybe you should have just gone yourself...",
      "You got Carl everything he asked for, but he's still too scared to fight.",
      "You tried to convince Carl death isn't so bad after all.",
      "You convinced Carl to go get his camels back, and he has! Just talk to him in Uragota Town.",
      "",
      "You've offered to get Carl's camels back for him. You'll want to look at a nearby port town for more info.",
      "Kai has revealed the camels were transported out to sea already.",
      "Kai is willing to take you to the thieves' hideout whenever you are ready. Just talk to him at the Uragota docks.",
      "Kai is willing to take you to the thieves' hideout whenever you are ready. Just talk to him at the Uragota docks.",
      "Kai is willing to take you to the thieves' hideout whenever you are ready. Just talk to him at the Uragota docks.",
      "Kai is willing to take you to the thieves' hideout whenever you are ready. Just talk to him at the Uragota docks.",
      "You've made it to the thieve's hideout. Now you just need to kill them all!",
      "You killed all the thieves! Collect the camels and return to Carl.",
      "You saved the camels!",
      "Speak to Carl to finish the quest.",
      "Speak to Carl to finish the quest."
    ]
  },
  {
    "name": "Queple's Sword",
    "id": 6,
    "completionText": "Congratulations! You solved the mystery of Queple's Sword!",
    "progressToComplete": 10000,
    "progressStrings": [
      "You haven't started this quest yet. You'll need to find Queple's grave to begin.",
      "You found a strange sword in an old tomb.",
      "Ken told you the sword you found is probably from Tackure.",
      "Ken told you to talk to Kumuhana in the village to learn more about the sword.",
      "Kumuhana has revealed that the sword is a weapon from Imaynimayn.",
      "You admitted to stealing the sword from a tomb.",
      "",
      "You told Kumuhana you found the sword near Mt. Queple.",
      "Kumuhana suggests returning the sword to the great Imaynimayn. Maybe he has something that can make it useable...",
      "You returned the cleaned sword to Queple's Tomb and activated the sword!"
    ]
  }
]