[
  {
    "versionNumber": "0.0.18",
    "updates": [
      "Fixed some bugs with the smithing UI.",
      "Made auto smithing work a little bit better when multiple ingredients are involved.",
      "Made tooltips for smithing now tell your more specifically what you need.",
      "Added more smithies with more strict metal requirements.",
      "More changes to how smithies work.",
      "Fixed name typos.",
      "Increased the number of places you can find a boar.",
      "Added Sahota Castle",
      "Added ice smithing."
    ]
  },
  {
    "versionNumber": "0.0.17",
    "updates": [
      "Fixed some bugs with the Pirate Ship and dialogues.",
      "Fixed an issue that could softlock an account to the Arawasago Archipelago.",
      "Actually fixed the softlock.",
      "Added the gem mine.",
      "Added the remaining smithies.",
      "Added sahotite weapons.",
      "Reworked smithies to show all possible recipes."
    ]
  },
  {
    "versionNumber": "0.0.16",
    "updates": [
      "Added many more followers to the game.",
      "Added quest guide text for Mound is Missing.",
      "Fixed a bug where you might not get a map from Mound after talking to him.",
      "Made it possible to get another map from Mound if you don't have one.",
      "Rebalanced inventory growth rate.",
      "Added an NPC to explain laying hunting traps."
    ]
  },
  {
    "versionNumber": "0.0.15",
    "updates": [
      "Added progress bar to crafting menu.",
      "Made it possible to open crafting menu with crafting items.",
      "Added item locks. Not sold on the design, let me know if you have a better idea!",
      "Adjusted inventory growth rate.",
      "Added a third line of info the tooltip for skills in the skills tab.",
      "Added more commas.",
      "Fixed a bug that broke idle gathering with followers.",
      "Fixed issues with smithing experience being given at the wrong times from the wrong places.",
      "Reworked the smithing and autosmithing functions, hopefully didn't break anything.",
      "Reworked gathering to hopefully work as intented.",
      "Fixed a bug that caused the first gather to not include gathering speed bonuses in calculating gather time."
    ]
  },
  {
    "versionNumber": "0.0.14",
    "updates": [
      "Added drops to the sawoka vault.",
      "Fixed a bug where you could get too many keys.",
      "Fixed a bug with library keys.",
      "Fixed a crash in Koncave Caverns.",
      "Mound will now take any extra keys you might have taking up bank space.",
      "Combat followers no longer run to and from the bank while you are skilling.",
      "Fixed a few bugs involving non-gathering followers.",
      "Added ice fishing.",
      "Added missing images to Sahota.",
      "Added hunting camp.",
      "Added ability to hunt polar bears and mammoths.",
      "Fixed a bug that broke saves when hunting polar bears and mammoths.",
      "Made a backup for if you somehow load a save that was on a schrodinger's hunting trip.",
      "Added an NPC to explain how to upgrade gear.",
      "Made it possible to open the Experience Tracker menu without gaining experience."

    ]
  },
  {
    "versionNumber": "0.0.13",
    "updates": [
      "Fixed a typo in Queple Cave.",
      "Fixed a bug that didn't let you buy items with exact change.",
      "Added version number to start screen.",
      "Fixed a bug that made the crafting menu crash.",
      "Made messages a bit more distinct.",
      "Hid the debug menu."
    ]
  },
  {
    "versionNumber": "0.0.12",
    "updates": [
      "Added some missing NPCs",
      "Renamed some NPCs to fix some typos.",
      "Added some missing items.",
      "Fixed a number of dialogue issues with Grand Theft Camel.",
      "Added quest progress text for the Grand Theft Camel and Tutorial quests.",
      "Made coal x20 easier to mine. It's not fast now, it just was incredibly slow before.",
      "Added silver ore.",
      "Added action start text for a number of actions.",
      "Added necklaces.",
      "Fixed capitalization on a few buttons",
      "Added way to access Mt. Queple's peak.",
      "Fixed a number of issues with alchemy.",
      "Fixed Oikaaz's dialogue.",
      "Added silver smithing recipes.",
      "Added necklace recipes.",
      "Made dropdowns look nicer.",
      "Added missing area icons.",
      "Added remaining alchemy halls.",
      "Added a boat to the boat store.",
      "Added a way to get a number of unobtainable items."
    ]
  },
  {
    "versionNumber": "0.0.11",
    "updates": [
      "Updated the version number to motivate me further.",
      "Fixed a typo in the Mayor's Assistant quest.",
      "Added quest progress logs for mayor's assistant.",
      "Added the library",
      "Fixed some bugs with Grand Theft Camel",
      "Fixed an issue with crafting after fleeing battles.",
      "Added support for changing the game background.",
      "Fixed typos in recipe descriptions.",
      "Added the Sawoka Library and Vault.",
      "Added some NPCs to explain how to navigate the swamp.",
      "Moved some ores around to make early smithing and mining more accessible.",
      "Fixed a bug that made pickaxes not grant combat experience.",
      "Fixed a number of bugs with NPCs not being properly set up.",
      "Made tooltips much more consistent in staying up while gathering and crafting.",
      "Improved readability of skills menus.",
      "Improved Exp. Tracker to work with most recent skills more clearly."
    ]
  },
  {
    "versionNumber": "0.0.10",
    "updates": [
      "Added update list to start menu.",
      "Filled out remaining monster drop tables.",
      "Players can now right click a blocked area to withdraw the requirement from the bank if they have it.",
      "Improved shop UI so players won't accidentally buy anything anymore.",
      "Buy X is now available in shops.",
      "Added Discord and Patreon links to start menu.",
      "Added more fishing rods.",
      "Removed duplicate items.",
      "Completed the Swampwood maze.",
      "Removed a number of debugging buttons from the game.",
      "Completed more of the Togaru Hills region.",
      "Follower inventories are now hidden on the equipment screen.",
      "Didn't fix a bug with autosmithing, but now it's far less obvious that it's happening. Maybe someday I'll figure out what's happening...",
      "Fixed a typo with bronze smithing recipes.",
      "Improved the mayor's assistant quest.",
      "Added a notification for when an area's traps are ready.",
      "Improved the shop UI a bit.",
      "Added more afk actions to make training without the game open more possible.",
      "Fixed some bugs with saving afk actions.",
      "Fixed a host of bugs involved with saving and loading."
    ]
  }
]